УТ_для_edt/src/Documents/смартIECHOСпецификация/смартIECHOСпецификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартIECHOСпецификация</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаЗакупку</name>
    <comment>// 17.01.2021</comment>
    <type>
      <types>CatalogRef.смартIECHOСкидкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Маржа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействияКП</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставкиДней</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоГраницыРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьТаможенногоОформления</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПоРФ</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьОборудования</name>
    <comment>// 22.04.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоДляКлиентаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЦенаЗакупкиСоСкидкой</name>
    <comment>// 12.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаржаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рентабельность</name>
    <comment>#1326 смарт: Лопато 20.03.2023 //Расчет маржи в спецификациях iECHO</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиЖДТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиАМТранспортом</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаЗаполненияСтоимости</name>
    <comment>//++ #1376 смарт: Фролов 18.06.2023 //доработка функционала консруктора iECHO (Глобализация параметров)  </comment>
    <type>
      <types>CatalogRef.смартiECHOЗаполнениеСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.смартТипыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>НаименованиеКомплектующей</name>
      <type>
        <types>CatalogRef.смартIECHOКомплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/смартIECHOКомплектующие/смартIECHOКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартIECHOКомплектующие</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УточнениеВНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьУточнениеВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Важно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.смартIECHOКомплектующиеПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКомплектующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоМоделям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>EnumRef.смартIECHOМоделиКомплектующих</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <comment>Тип модели на английском</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоРазмеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентРасчетаСебестоимости</name>
    <comment>// 16.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючеваяКомплектующая</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КабельВКомплекте</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МоделиДляИспользования</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>EnumRef.смартIECHOМоделиКомплектующих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыДляИспользования</name>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартIECHOСпецификация/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	НаименованиеОборудования = СформироватьНаименованиеОборудования();	
	
КонецПроцедуры

// ++ 19.01.2021
Процедура ПриЗаписи(Отказ)
	
	//++ #Б-2620 смарт: Лопато 12.03.2025 //Удалить Спецификации по IECHO из задач.  
	// Закомментировал код
	//Если ПометкаУдаления Тогда
	//	Попытка
	//		ВыполнитьЗадачуБизнесПроцесса();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	//-- #Б-2620 смарт: Лопато 12.03.2025
	
КонецПроцедуры

Функция СформироватьНаименованиеОборудования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Комплектующие.НаименованиеКомплектующей КАК Справочник.смартIECHOКомплектующие) КАК НаименованиеКомплектующей
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТЧ.НаименованиеКомплектующей.Наименование КАК Наименование,
	|	ВТ_ТЧ.НаименованиеКомплектующей.ОсновнаяКомплектующая КАК ОсновнаяКомплектующая
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнаяКомплектующая УБЫВ,
	|	Наименование";
	
	Запрос.УстановитьПараметр("ТЧ", Комплектующие.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Результат + ?(ЗначениеЗаполнено(Результат), "_", "") + Выборка.Наименование;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область Печать

Функция СформироватьКоммерческоеПредложение() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	МакетКП = ПолучитьМакет("МакетКП");
	ОбластьКП = МакетКП.ПолучитьОбласть("ОбластьКП");
	ТабДок.Вывести(ОбластьКП);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

// ++ 19.01.2021
Процедура ВыполнитьЗадачуБизнесПроцесса()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	НЕ ЗадачаИсполнителя.Выполнена
	|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЗадачаИсполнителя.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ПометитьСпецификациюНаУдаление); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Задача = Выборка.Ссылка.ПолучитьОбъект();		
		Задача.ВыполнитьЗадачу();
		// БП должен сам завершиться, т.к. это финальная точка
	Иначе
		
		// Завершить БП, если текущая точка маршрута любая другая
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартIECHOПродажа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_БизнесПроцессы
		|ИЗ
		|	БизнесПроцесс.смартIECHOПродажа КАК смартIECHOПродажа
		|ГДЕ
		|	смартIECHOПродажа.Стартован
		|	И смартIECHOПродажа.Предмет = &Предмет
		|	И НЕ смартIECHOПродажа.Завершен";
		
		Запрос.УстановитьПараметр("Предмет", Ссылка);
		ВыборкаБП = Запрос.Выполнить().Выбрать();
		Пока ВыборкаБП.Следующий() Цикл
			смартОбщегоНазначения.ЗавершитьБизнесПроцессИЗадачи(ВыборкаБП.Ссылка, "Спецификация помечена на удаление. Бизнес-процесс остановлен");
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры

//++ смарт:ММ 621 30.09.2021 
Процедура СортироватьТаблицуКомплектующих() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Цена КАК Цена,
	|	ТЗ.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НаименованиеКомплектующей КАК НаименованиеКомплектующей,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Цена КАК Цена,
	|	ВТ.Стоимость КАК Стоимость,
	|	смартIECHOКомплектующие.Порядок КАК Порядок
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующие
	|		ПО ВТ.НаименованиеКомплектующей = смартIECHOКомплектующие.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартIECHOКомплектующие.Порядок";
	
	Запрос.УстановитьПараметр("ТЗ", Комплектующие.Выгрузить());
	
	Комплектующие.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры //-- смарт:ММ 30.09.2021
